Revit 2026 API

# FilterDialog(Document, ElementId) Constructor

---

Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilterDialog(
	Document doc,
	ElementId filterToSelect
)
```
```vb
Public Sub New (
	doc As Document,
	filterToSelect As ElementId
)
```
```cpp
public:
FilterDialog(
	Document^ doc,
	ElementId^ filterToSelect
)
```
```fsharp
new :
        doc : Document *
        filterToSelect : ElementId -> FilterDialog
```

#### Parameters

doc Document
     The document that owns the FilterElements displayed and edited in the dialog.
filterToSelect ElementId
     The FilterElement to be selected. If InvalidElementId, then the first (if any) available FilterElement will be selected.

| Exception | Condition |
| --- | --- |
| ArgumentException | The supplied ElementId filterToSelect is not of a FilterElement. |
| ArgumentNullException | A non-optional argument was null |

Show the dialog with the Show() method after setting the desired options.

#### Reference

FilterDialog Class

FilterDialog Overload

Autodesk.Revit.UI Namespace